// 27.	Определить количество цифр в числе

Console.Clear();
int num;
string b;
System.Console.WriteLine(" Введите число  в котором считем цифры");
b = Console.ReadLine();
num = b.Length;
System.Console.WriteLine("количество цифр в числе {0}", num);