// 6.	Написать программу вычисления значения функции y = f(a)
double f(double a)
{
    return a*a;

}
 System.Console.WriteLine(f(2));
